Конфигурация/Reports/КарточкаСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>КарточкаСчета</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Единый</v8:Type>
						<v8:Type>cfg:ChartOfAccountsRef.Основной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетныйРегистр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>скПоЛицевомуСчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Конфигурация/Reports/КарточкаСчета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьПараметрыИсполненияОтчета() Экспорт
	
	Возврат Новый Структура("ИспользоватьПередКомпоновкойМакета,
							|ИспользоватьПослеКомпоновкиМакета,
							|ИспользоватьПослеВыводаРезультата,
							|ИспользоватьДанныеРасшифровки",
							Истина, Истина, Истина, Истина);
							
КонецФункции

Функция ПолучитьТекстЗаголовка(ПараметрыОтчета, ОрганизацияВНачале = Истина) Экспорт 
	
	Возврат "Карточка счета " + ПараметрыОтчета.Счет + РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ПараметрыОтчета.НачалоПериода, ПараметрыОтчета.КонецПериода);
	
КонецФункции

// В процедуре можно доработать компоновщик перед выводом в отчет
// Изменения сохранены не будут
Процедура ПередКомпоновкойМакета(ПараметрыОтчета, Схема, КомпоновщикНастроек) Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.Счет) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Счет", БухгалтерскийУчет.СчетаВИерархии(ПараметрыОтчета.Счет));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.НачалоПериода) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоДня(ПараметрыОтчета.НачалоПериода));
	Иначе
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", Дата(1, 1, 1));
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыОтчета.КонецПериода) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецДня(ПараметрыОтчета.КонецПериода));
	Иначе
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", Дата(3999, 11, 1));
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек.Настройки.Структура[0].Структура[0].Отбор, "ПериодГруппировки",,ВидСравненияКомпоновкиДанных.Заполнено);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек.Настройки.Структура[0].Структура[0].Структура[0].Отбор, "Регистратор",,ВидСравненияКомпоновкиДанных.Заполнено);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек.Настройки.Структура[1].Структура[0].Отбор, "Регистратор",,ВидСравненияКомпоновкиДанных.Заполнено);

	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(КомпоновщикНастроек.Настройки.Структура[0].Структура[0], "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(КомпоновщикНастроек.Настройки.Структура[0].Структура[0].Структура[0], "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметрВывода(КомпоновщикНастроек.Настройки.Структура[1].Структура[0], "ВыводитьОтбор", ТипВыводаТекстаКомпоновкиДанных.НеВыводить);

	Если ПараметрыОтчета.Периодичность = 0 Тогда
		КомпоновщикНастроек.Настройки.Структура[0].Использование = Ложь;
		КомпоновщикНастроек.Настройки.Структура[1].Использование = Истина;
	Иначе
		КомпоновщикНастроек.Настройки.Структура[0].Использование = Истина;
		КомпоновщикНастроек.Настройки.Структура[1].Использование = Ложь;
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Периодичность", ПараметрыОтчета.Периодичность);
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ПС", Символы.ПС);
	
	Если ЗначениеЗаполнено(ПараметрыОтчета.СчетДоверительногоУправления) Тогда
		РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(КомпоновщикНастроек, "СчетДоверительногоУправления", ПараметрыОтчета.СчетДоверительногоУправления,,, Истина);
	КонецЕсли;
	
	ЛинияСплошная = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная, 1);
	
	МассивМакетов = Новый Массив;
	МассивМакетов.Добавить("ПериодГруппировкиЗаголовок"); 
	МассивМакетов.Добавить("ОбщиеИтогиЗаголовок");
	МассивМакетов.Добавить("ОбщиеИтогиПодвал");
	МассивМакетов.Добавить("ПроводкиЗаголовок");	
		
	Для Каждого ЭлементМакет Из МассивМакетов Цикл
		Схема.Макеты[ЭлементМакет].Макет = РаботаСБухгалтерскимиОтчетами.ПолучитьКопиюОписанияМакета(Схема.Макеты[ЭлементМакет + "Образец"].Макет);
		ОписаниеМакета = Схема.Макеты[ЭлементМакет].Макет;
		
		МассивСтрокДляУдаления = Новый Массив;
		Индекс = 0;
		Для Каждого ЭлементМассива Из ПараметрыОтчета.НаборПоказателей Цикл
			Если Не ПараметрыОтчета["Показатель" + ЭлементМассива] Тогда 
				МассивСтрокДляУдаления.Добавить(ОписаниеМакета[Индекс]);
			КонецЕсли;
			Индекс = Индекс + 1;
		КонецЦикла;	
		
		Для Каждого Строка Из МассивСтрокДляУдаления Цикл
			ОписаниеМакета.Удалить(Строка);
		КонецЦикла;
		
		КоличествоСтрок = ОписаниеМакета.Количество();
		
		// Обвести область
		Если КоличествоСтрок > 0 Тогда
			Для Индекс = 0 По 12 Цикл
				ПоследняяСтрока = ?(ЭлементМакет = "ОбщиеИтогиПодвал" И Индекс < 4, 0, КоличествоСтрок - 1);
				ПараметрГраницы = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПараметр(ОписаниеМакета[0].Ячейки[Индекс].Оформление.Элементы, "СтильГраницы");
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ПараметрГраницы.ЗначенияВложенныхПараметров, "СтильГраницы.Сверху", ЛинияСплошная);
				ПараметрГраницы = РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПараметр(ОписаниеМакета[ПоследняяСтрока].Ячейки[Индекс].Оформление.Элементы, "СтильГраницы");
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ПараметрГраницы.ЗначенияВложенныхПараметров, "СтильГраницы.Снизу", ЛинияСплошная);	
			КонецЦикла;
		КонецЕсли;
		
		Для Индекс = 1 По КоличествоСтрок - 1 Цикл
			ОписаниеМакета[Индекс].Ячейки[0].Элементы.Очистить();	
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[0].Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[0].Оформление.Элементы, "Расшифровка", Неопределено, Ложь);
			ОписаниеМакета[Индекс].Ячейки[1].Элементы.Очистить();
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[1].Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[1].Оформление.Элементы, "Расшифровка", Неопределено, Ложь);
			ОписаниеМакета[Индекс].Ячейки[2].Элементы.Очистить();
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[2].Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[2].Оформление.Элементы, "Расшифровка", Неопределено, Ложь);
			ОписаниеМакета[Индекс].Ячейки[3].Элементы.Очистить();
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[3].Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
			РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[3].Оформление.Элементы, "Расшифровка", Неопределено, Ложь);
			Если ЭлементМакет = "ПроводкиЗаголовок" Тогда
				ОписаниеМакета[Индекс].Ячейки[5].Элементы.Очистить();
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[5].Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[5].Оформление.Элементы, "Расшифровка", Неопределено, Ложь);
				ОписаниеМакета[Индекс].Ячейки[8].Элементы.Очистить();
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[8].Оформление.Элементы, "ОбъединятьПоВертикали", Истина);
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.УстановитьПараметр(ОписаниеМакета[Индекс].Ячейки[8].Оформление.Элементы, "Расшифровка", Неопределено, Ложь);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если Не ПараметрыОтчета.ПоказательБУ Тогда
		ГруппаОтборов = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаОтборов.Использование = Истина;
		ГруппаОтборов.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
		Для Каждого ЭлементМассива Из ПараметрыОтчета.НаборПоказателей Цикл
			Если ЭлементМассива <> "БУ" И ПараметрыОтчета["Показатель" + ЭлементМассива] Тогда
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаОтборов, ЭлементМассива + "Дт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
				РаботаСБухгалтерскимиОтчетамиКлиентСервер.ДобавитьОтбор(ГруппаОтборов, ЭлементМассива + "Кт", 0, ВидСравненияКомпоновкиДанных.НеРавно);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	РаботаСБухгалтерскимиОтчетами.ДобавитьОтборПоОрганизации(ПараметрыОтчета, КомпоновщикНастроек);	
	
	//Иванов 2016-08-23 Начало...
	Если Схема.ВычисляемыеПоля.Найти("АналитикаДт") <> Неопределено Тогда 
		Схема.ВычисляемыеПоля.Найти("АналитикаДт").Выражение =  СтрЗаменить(Схема.ВычисляемыеПоля.Найти("АналитикаДт").Выражение,
		" + Выбор Когда ЛицевойСчет Есть NULL Тогда """" Когда Не ЗначениеЗаполнено(Представление(ЛицевойСчет)) Тогда ""<...>"" Иначе Представление(ЛицевойСчет) Конец"
		,"");
	КонецЕсли;
	
	Если Схема.ВычисляемыеПоля.Найти("АналитикаКт") <> Неопределено Тогда
		Схема.ВычисляемыеПоля.Найти("АналитикаКт").Выражение =  СтрЗаменить(Схема.ВычисляемыеПоля.Найти("АналитикаКт").Выражение,
		" + Выбор Когда ЛицевойСчет Есть NULL Тогда """" Когда Не ЗначениеЗаполнено(Представление(ЛицевойСчет)) Тогда ""<...>"" Иначе Представление(ЛицевойСчет) Конец"
		,"");
	КонецЕсли;
	
	Если ПараметрыОтчета.УчетныйРегистр = "ЕдиныйБухгалтерскийУчет" 
		И Схема.НаборыДанных.Найти("Проводки") <> Неопределено Тогда 
		
		// Корректировка текста запроса и полей выражений для работы с новым регистром и планом счетов.
		
		Если СтрЧислоВхождений(Схема.НаборыДанных.Проводки.Запрос,  ПараметрыОтчета.УчетныйРегистр) = 0 Тогда 
			Схема.НаборыДанных.Проводки.Запрос = 
			СтрЗаменить(Схема.НаборыДанных.Проводки.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
		КонецЕсли;
		
		Если ПараметрыОтчета.скПоЛицевомуСчету Тогда 
			
			// Текст запроса
			Если СтрЧислоВхождений(Схема.НаборыДанных.Проводки.Запрос, "Проводки.ЛицевойСчетДт КАК ЛицевойСчетДт,") = 0 Тогда
				
				Схема.НаборыДанных.Проводки.Запрос = 
				СтрЗаменить(Схема.НаборыДанных.Проводки.Запрос, "Проводки.СчетДт КАК СчетДт,", "Проводки.СчетДт КАК СчетДт, Проводки.ЛицевойСчет КАК ЛицевойСчет, Проводки.ЛицевойСчетДт КАК ЛицевойСчетДт, Проводки.ЛицевойСчетКт КАК ЛицевойСчетКт,");
				
				Схема.НаборыДанных.Проводки.Запрос = 
				СтрЗаменить(Схема.НаборыДанных.Проводки.Запрос, "ДвиженияССубконто.СчетДт КАК СчетДт,", "ДвиженияССубконто.СчетДт КАК СчетДт, ЕдиныйБухгалтерскийУчетОстаткиИОбороты.ЛицевойСчет КАК ЛицевойСчет, ДвиженияССубконто.ЛицевойСчетДт КАК ЛицевойСчетДт, ДвиженияССубконто.ЛицевойСчетКт КАК ЛицевойСчетКт,");
				
				Схема.НаборыДанных.Проводки.Запрос = 
				СтрЗаменить(Схема.НаборыДанных.Проводки.Запрос, "СчетДт.*,", "СчетДт.*, ЛицевойСчет.*, ЛицевойСчетДт.*, ЛицевойСчетКт.*, ");
				
			КонецЕсли;
			
			// Поля выражений
			Если Схема.ВычисляемыеПоля.Найти("АналитикаДт") <> Неопределено Тогда 
				Схема.ВычисляемыеПоля.Найти("АналитикаДт").Выражение =  Схема.ВычисляемыеПоля.Найти("АналитикаДт").Выражение + 
				" + Выбор Когда ЛицевойСчет Есть NULL Тогда """" Когда Не ЗначениеЗаполнено(Представление(ЛицевойСчет)) Тогда ""<...>"" Иначе Представление(ЛицевойСчет) Конец";
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;		
	//... Иванов 2016-08-23 Конец

КонецПроцедуры

Процедура ПослеКомпоновкиМакета(ПараметрыОтчета, МакетКомпоновки) Экспорт
	
	//Разные регистры
	Если ЗначениеЗаполнено(ПараметрыОтчета.УчетныйРегистр) Тогда
		Если ПараметрыОтчета.УчетныйРегистр <> "БухгалтерскийУчет" 
			//Иванов 2016-08-23 Для данного регистра текст запроса изменяется ранее Начало...
			И ПараметрыОтчета.УчетныйРегистр <> "ЕдиныйБухгалтерскийУчет" Тогда
			//... Иванов 2016-08-23 Конец
			МакетКомпоновки.НаборыДанных.Проводки.Запрос = СтрЗаменить(МакетКомпоновки.НаборыДанных.Проводки.Запрос, "БухгалтерскийУчет", ПараметрыОтчета.УчетныйРегистр);
		КонецЕсли;
	КонецЕсли;
	
	КоличествоПоказателей = РаботаСБухгалтерскимиОтчетами.КоличествоПоказателей(ПараметрыОтчета);
	
	// Если показатель один, то удалим столбик "Показатель"
	Если КоличествоПоказателей = 1 Тогда
		Для Каждого Макет Из МакетКомпоновки.Макеты Цикл
			Для Каждого СтрокаМакета Из Макет.Макет Цикл
				СтрокаМакета.Ячейки.Удалить(СтрокаМакета.Ячейки[4]);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	МакетПроводки = РаботаСБухгалтерскимиОтчетами.ПолучитьМакетГруппировкиПоПолюГруппировки(МакетКомпоновки, "Проводки", Истина);
	
	Если МакетПроводки.Количество() = 1 Тогда
		МакетПроводки = МакетПроводки[0];
		ИмяМакетПроводок = МакетПроводки.Имя;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеВыводаРезультата(ПараметрыОтчета, Результат) Экспорт
	
	РаботаСБухгалтерскимиОтчетами.ОбработкаРезультатаОтчета(ПараметрыОтчета.ИдентификаторОтчета, Результат);

	Если Результат.Области.Найти("Заголовок") = Неопределено Тогда
		Результат.ФиксацияСверху = 2;
	Иначе
		Результат.ФиксацияСверху = Результат.Области.Заголовок.Низ + 2;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНаборПоказателей() Экспорт
	
	НаборПоказателей = Новый Массив;
	НаборПоказателей.Добавить("БУ");
	НаборПоказателей.Добавить("ВалютнаяСумма");
	НаборПоказателей.Добавить("Количество");
	
	Возврат НаборПоказателей;
	
КонецФункции

#КонецЕсли
